## Plan Result (dev_frontdoor)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 0 to add, 1 to change, 9 to destroy.</code></pre>

* Update
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
* Delete
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;vh-video-web-pr-2057&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;vh-video-web-pr-2057&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;vh-video-web-pr-2057&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;vh-video-web-pr-2057&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;vh-video-web-pr-2057&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;vh-video-web-pr-2057&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-video-web-pr-2057&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;vh-video-web-pr-2057&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;vh-video-web-pr-2057&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.data.azurerm_dns_zone.public_dns["dev-casetracker"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_dns_zone" "public_dns" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "casetracker.justice.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformmgmtrg"
      + tags                      = (known after apply)
    }

  # module.premium_front_door.data.azurerm_dns_zone.public_dns["dev-certificatedbailiffs"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_dns_zone" "public_dns" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "certificatedbailiffs.justice.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformmgmtrg"
      + tags                      = (known after apply)
    }

  # module.premium_front_door.data.azurerm_dns_zone.public_dns["dev-courtfines"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_dns_zone" "public_dns" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "courtfines.direct.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformmgmtrg"
      + tags                      = (known after apply)
    }

  # module.premium_front_door.data.azurerm_dns_zone.public_dns["dev-immigrationappealsonline"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_dns_zone" "public_dns" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "immigrationappealsonline.justice.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformmgmtrg"
      + tags                      = (known after apply)
    }

  # module.premium_front_door.data.azurerm_dns_zone.public_dns["pre-portal"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_dns_zone" "public_dns" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "dev.platform.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformmgmtrg"
      + tags                      = (known after apply)
    }

  # module.premium_front_door.data.azurerm_dns_zone.public_dns["sds-api-mgmt"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_dns_zone" "public_dns" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "dev.platform.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformmgmtrg"
      + tags                      = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["vh-video-web-pr-2057"] will be destroyed
  # (because key ["vh-video-web-pr-2057"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      - cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev" -> null
      - expiration_date          = "0001-01-01T00:00:00.0000000" -> null
      - host_name                = "vh-video-web-pr-2057.dev.platform.hmcts.net" -> null
      - id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/vh-video-web-pr-2057" -> null
      - name                     = "vh-video-web-pr-2057" -> null

      - tls {
          - cdn_frontdoor_secret_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/secrets/46bf4e26-b006-473c-a3e8-f5962b672b98-vh-video-web-pr-2057-dev-platform-hmcts-net" -> null
          - certificate_type        = "ManagedCertificate" -> null
          - minimum_tls_version     = "TLS12" -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["vh-video-web-pr-2057"] will be destroyed
  # (because key ["vh-video-web-pr-2057"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      - cdn_frontdoor_custom_domain_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/vh-video-web-pr-2057" -> null
      - cdn_frontdoor_route_ids        = [
          - "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/vh-video-web-pr-2057",
        ] -> null
      - id                             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/associations/vh-video-web-pr-2057" -> null
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["vh-video-web-pr-2057"] will be destroyed
  # (because key ["vh-video-web-pr-2057"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      - cdn_frontdoor_custom_domain_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/vh-video-web-pr-2057" -> null
      - cdn_frontdoor_route_ids        = [
          - "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/vh-video-web-pr-2057HttpsRedirect",
        ] -> null
      - id                             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/associations/vh-video-web-pr-2057" -> null
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom["vh-video-web-pr-2057"] will be destroyed
  # (because key ["vh-video-web-pr-2057"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
      - custom_block_response_status_code = 0 -> null
      - enabled                           = true -> null
      - frontend_endpoint_ids             = [] -> null
      - id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhvideowebpr2057devPremium" -> null
      - mode                              = "Prevention" -> null
      - name                              = "vhvideowebpr2057devPremium" -> null
      - resource_group_name               = "lz-dev-rg" -> null
      - sku_name                          = "Premium_AzureFrontDoor" -> null
      - tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/sds-azure-platform"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "development"
          - "startupMode"  = "always"
        } -> null

      - managed_rule {
          - action  = "Block" -> null
          - type    = "DefaultRuleSet" -> null
          - version = "1.0" -> null

          - exclusion {
              - match_variable = "QueryStringArgNames" -> null
              - operator       = "Equals" -> null
              - selector       = "code" -> null
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin["vh-video-web-pr-2057"] will be destroyed
  # (because key ["vh-video-web-pr-2057"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
      - cdn_frontdoor_origin_group_id  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/originGroups/vh-video-web-pr-2057" -> null
      - certificate_name_check_enabled = true -> null
      - enabled                        = true -> null
      - health_probes_enabled          = true -> null
      - host_name                      = "firewall-nonprodi-palo-sdsdev.uksouth.cloudapp.azure.com" -> null
      - http_port                      = 80 -> null
      - https_port                     = 443 -> null
      - id                             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/originGroups/vh-video-web-pr-2057/origins/vh-video-web-pr-2057" -> null
      - name                           = "vh-video-web-pr-2057" -> null
      - origin_host_header             = "vh-video-web-pr-2057.dev.platform.hmcts.net" -> null
      - priority                       = 1 -> null
      - weight                         = 50 -> null
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group["vh-video-web-pr-2057"] will be destroyed
  # (because key ["vh-video-web-pr-2057"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_origin_group" "origin_group" {
      - cdn_frontdoor_profile_id                                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev" -> null
      - id                                                        = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/originGroups/vh-video-web-pr-2057" -> null
      - name                                                      = "vh-video-web-pr-2057" -> null
      - restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10 -> null
      - session_affinity_enabled                                  = false -> null

      - load_balancing {
          - additional_latency_in_milliseconds = 0 -> null
          - sample_size                        = 4 -> null
          - successful_samples_required        = 2 -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["vh-video-web-pr-2057"] will be destroyed
  # (because key ["vh-video-web-pr-2057"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      - cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/vh-video-web-pr-2057",
        ] -> null
      - cdn_frontdoor_endpoint_id       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev" -> null
      - cdn_frontdoor_origin_group_id   = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/originGroups/vh-video-web-pr-2057" -> null
      - cdn_frontdoor_origin_ids        = [
          - "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/originGroups/vh-video-web-pr-2057/origins/vh-video-web-pr-2057",
        ] -> null
      - cdn_frontdoor_rule_set_ids      = [] -> null
      - enabled                         = true -> null
      - forwarding_protocol             = "HttpOnly" -> null
      - https_redirect_enabled          = false -> null
      - id                              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/vh-video-web-pr-2057" -> null
      - link_to_default_domain          = false -> null
      - name                            = "vh-video-web-pr-2057" -> null
      - patterns_to_match               = [
          - "/*",
        ] -> null
      - supported_protocols             = [
          - "Https",
        ] -> null

      - cache {
          - compression_enabled           = false -> null
          - content_types_to_compress     = [] -> null
          - query_string_caching_behavior = "UseQueryString" -> null
          - query_strings                 = [] -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B["vh-video-web-pr-2057"] will be destroyed
  # (because key ["vh-video-web-pr-2057"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      - cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/vh-video-web-pr-2057",
        ] -> null
      - cdn_frontdoor_endpoint_id       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev" -> null
      - cdn_frontdoor_origin_group_id   = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/originGroups/defaultBackend" -> null
      - cdn_frontdoor_origin_ids        = [
          - "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/originGroups/defaultBackend/origins/defaultBackend",
        ] -> null
      - cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/ruleSets/httpsredirect",
        ] -> null
      - enabled                         = true -> null
      - forwarding_protocol             = "MatchRequest" -> null
      - https_redirect_enabled          = false -> null
      - id                              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/afdEndpoints/sdshmcts-dev/routes/vh-video-web-pr-2057HttpsRedirect" -> null
      - link_to_default_domain          = false -> null
      - name                            = "vh-video-web-pr-2057HttpsRedirect" -> null
      - patterns_to_match               = [
          - "/*",
        ] -> null
      - supported_protocols             = [
          - "Http",
        ] -> null
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["vh-video-web-pr-2057"] will be destroyed
  # (because key ["vh-video-web-pr-2057"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev" -> null
      - id                       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/securityPolicies/vhvideowebpr2057devPremium-securityPolicy" -> null
      - name                     = "vhvideowebpr2057devPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhvideowebpr2057devPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev/customDomains/vh-video-web-pr-2057" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Cdn/profiles/sdshmcts-dev|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 9 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":616,"Program":"tfcmt","SHA1":"","Target":"dev_frontdoor","Vars":{}} -->